app/controllers/site_controller.rb

  def show_profile
    @profile = Profile.find_by_url(params[:profile_id])
    redirect_to 'public/404.html' if @profile.nil?
    @configurations = {}
    GAConfig.all.collect{|ga| @configurations[ga.event] = ga.value}
    if @profile
      @google_analytics = @profile.google_analytics
      @marker = @profile.marker

      reg = Regexp.new('^http(s?):\/\/')
      if reg.match(@profile.website)
        @website = @profile.website
      else
        @website = 'http://' + @profile.website if @profile.website
      end
    end
    @pages = Page.find(:all ,:order => "position")
    @footer_text = Option.getValue(FOOTER_TEXT)
    @googleMapsKey = Option.getValue(GOOGLE_MAPS_API_KEY)

    if params[:gallery_open]
      @gallery_images = GalleryImage.find_all_by_profile_id(@profile.id).paginate(:page => params[:page] || 1, :per_page => 9)
---
SELECT * FROM `profiles` WHERE (`profiles`.`url` = 'profile1') LIMIT 1
SELECT * FROM `ga_configs`
SELECT * FROM `markers` WHERE (`markers`.profile_id = 1) LIMIT 1
SELECT count(*) AS count_all FROM `gallery_images` WHERE (`gallery_images`.profile_id = 1)

  def page
    @pages = Page.find(:all ,:order => "position")
    @page = Page.find_by_name(params[:page_name])
---
SELECT * FROM `pages` WHERE (`pages`.`name` = 'profile1') LIMIT 1