app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def home
    @user = User.find(session['user_id'])